//** while() */ 

// let i = 0;
// while(i <= 20) {
//     i % 2 == 0 ? console.log(i, 'число верно') : console.log(i, 'ошибка')
//     i++;
// }

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


//** for(let i = 0; i < 10; i++){} */
// for(let i = 0 ; i <= 16; i++) {
//     i % 2 == 0 ? console.log(i, 'число верно') : console.log(i, 'ошибка')
// }


// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
TODO: //** let i = 0; do {i++} while(i < 4) */

// let i = 0;
// do {
//     console.log(i);
//     i = i + 1;
// }while( i < 4);
